itaejin/stm32-gas-supply-system/test12/gas_test1/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "TS_commu.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
// ⭐ 백그라운드 작업 처리 함수 선언 추가
void ProcessBackgroundTasks(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
uint16_t adcdata1, adcdata2, adcdata3, adcCnt=0;
uint8_t sw2, sw1, sw0;
#include "stm32f1xx_hal_adc.h"
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  init_TS_commu();
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */
  start_TS_commu();
  HAL_TIM_Base_Start_IT(&htim2);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	  // ⭐⭐⭐ 백그라운드 작업 처리 - Timer 인터럽트에서 이동한 무거운 작업들 ⭐⭐⭐
	  ProcessBackgroundTasks();

	  if(TestFlash) {
		  if(TestFlash == 1) {
			  ReadFlash((uint32_t*)&fParam);
			  ReadFlashParam();  // 읽은 후 변수 업데이트 (이 줄 추가)
		  }
		  else if(TestFlash == 3) EraseFlash();
		  else {
			  SaveFlashParam();  // 현재 설정값을 저장 (기존 WriteFlash 대신)
//			  WriteFlash((uint32_t*)&fParam);
		  }
		  TestFlash = 0;
	  }
//	  HAL_ADC_Start_IT(hadc1);
	  ADC_ChannelConfTypeDef sConfig = {0};
	  sConfig.Channel = ADC_CHANNEL_4;
	  sConfig.Rank = ADC_REGULAR_RANK_1;
	  sConfig.SamplingTime = ADC_SAMPLETIME_239CYCLES_5;
	  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  adcCnt++;
	  HAL_ADC_Start(&hadc1);
	  while(HAL_ADC_PollForConversion(&hadc1, 100)!=HAL_OK);
	  adcdata1 = HAL_ADC_GetValue(&hadc1);

	  sConfig.Channel = ADC_CHANNEL_5;
	  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  adcCnt++;
	  HAL_ADC_Start(&hadc1);
	  while(HAL_ADC_PollForConversion(&hadc1, 100)!=HAL_OK);
	  adcdata2 = HAL_ADC_GetValue(&hadc1);

	  sConfig.Channel = ADC_CHANNEL_6;
	  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
	  {
	    Error_Handler();
	  }
	  adcCnt++;
	  HAL_ADC_Start(&hadc1);
	  while(HAL_ADC_PollForConversion(&hadc1, 100)!=HAL_OK);
	  adcdata3 = HAL_ADC_GetValue(&hadc1);
	  adcCnt+=7;

      // ===== 🎛️ ADC 값을 실제 센서값으로 변환 =====
      // 4~20mA: 818 ~ 4096 범위
      // ⭐ ADC 값 처리는 TS_commu.c의 함수로 위임
      ProcessADCValues(adcdata3, adcdata2, adcdata1);

/*
      // 🔥 시뮬레이션 모드가 아닐 때만 실제 ADC 값 사용
      if(!simulation_mode) {
          float PT1scale = (float)(PT1.MaxSValue - PT1.MinSValue) / (4096 - 819);
          if(adcdata3 > 819) {
              PT1.Value = (uint16_t)(10 * ((adcdata3 - 819) * PT1scale + PT1.MinSValue));
              PT1.Value = PT1.Value + PT1.Offset;
              // 그래프 값도 동기화
              GraphPT1.Value = PT1.Value;
          }

          // PT2도 필요하면 활성화
          float PT2scale = (float)(PT2.MaxSValue - PT2.MinSValue) / (4096 - 819);
          if(adcdata2 > 819) {
              PT2.Value = (uint16_t)(10 * ((adcdata2 - 819) * PT2scale + PT2.MinSValue));
              PT2.Value = PT2.Value + PT2.Offset;
              GraphPT2.Value = PT2.Value;
          }
          // PT3 공급 압력 (예: adcdata1 사용)
          float PT3scale = (float)(PT3.MaxSValue - PT3.MinSValue) / (4096 - 819);
          if(adcdata1 > 819) {
              PT3.Value = (uint16_t)(10 * ((adcdata1 - 819) * PT3scale + PT3.MinSValue));
              PT3.Value = PT3.Value + PT3.Offset;
          }
      }
      // 🎮 시뮬레이션 모드일 때는 ADC 값 무시하고 가상 값 사용
      // (ProcessBackgroundTasks()에서 자동으로 처리됨)
*/
	  sw0 = HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_4);
	  sw0 |= HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_5) ? 2 : 0;
	  sw0 |= HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_6) ? 4 : 0;
	  sw0 |= HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_7) ? 8 : 0;

	  sw0 |= HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_3) ? 0x10 : 0;
	  sw0 |= HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_1) ? 0x20 : 0;
	  sw0 |= HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_2) ? 0x40 : 0;
	  sw0 |= HAL_GPIO_ReadPin(GPIOD, GPIO_PIN_0) ? 0x80 : 0;

	  sw2 = sw0 & 0x0F;
	  sw1 = (sw0 >> 4) & 0x0F;
  }
  // 기존 sw0, sw1, sw2 처리 아래에 추가
  // --------------[ 여기에 아래 코드 삽입 ]--------------

  GPIO_PinState emergStop = HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_5);     // 비상정지 IN
  GPIO_PinState pressureSensor = HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_6); // 압력센서 IN

  // 논리 상태 갱신
  IOdata.EmerSWOnLamp = (emergStop == GPIO_PIN_RESET) ? 1 : 0;
  IOdata.PressureLowLimit = (pressureSensor == GPIO_PIN_RESET) ? 1 : 0;

  // 실제 출력 제어
  if(IOdata.EmerSWOnLamp) { // 비상정지: 전체 off, 램프/부저 on
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_RESET); // SOL 좌
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET); // SOL 우
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, GPIO_PIN_SET);   // 적색 램프
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);   // 부저
  } else {
      // 경고(압력)/알람 처리
      if(IOdata.PressureLowLimit) {
          HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, GPIO_PIN_SET); // 적색 램프
          HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET); // 부저
      } else {
          HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, GPIO_PIN_RESET);
          if(IOdata.UseBuzzerLamp == 0 &&
             (IOdata.PrepChgPT1Alarm || IOdata.PrepChgPT2Alarm || IOdata.MinSuuplPressPT3)) {
              HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET); // 부저
          } else {
              HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET); // 부저
          }
      }
      // SOL 제어
      GPIO_PinState solL = (IOdata.SupplyGasLSW == 1) ?
          (IOdata.SolNoNCLamp == 0 ? GPIO_PIN_RESET : GPIO_PIN_SET) :
          (IOdata.SolNoNCLamp == 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
      GPIO_PinState solR = (IOdata.SupplyGasRSW == 1) ?
          (IOdata.SolNoNCLamp == 0 ? GPIO_PIN_RESET : GPIO_PIN_SET) :
          (IOdata.SolNoNCLamp == 0 ? GPIO_PIN_SET : GPIO_PIN_RESET);
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, solL);
      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, solR);
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.Prediv1Source = RCC_PREDIV1_SOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  RCC_OscInitStruct.PLL2.PLL2State = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV6;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the Systick interrupt time
  */
  __HAL_RCC_PLLI2S_ENABLE();
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
